Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `/secured/*` path can only be accessed by authenticated users. This way, you have secured the `/secured/all` path and so on.
ja_jp: `/secured/*` パスには、認証されたユーザーのみがアクセスできます。このようにして、 `/secured/all` パスなどが保護されます。

source: The `/standard-way` sub-path requires both the resource permission and the `read` scope, based on the configuration set in the `application.properties` file.
ja_jp: `/standard-way` サブパスには、 `application.properties` ファイルで設定された設定に基づいて、リソース権限と `read` スコープの両方が必要です。

source: The `/subject/authenticated` endpoint allows any authenticated user by specifying the `@Authenticated` annotation.
ja_jp: `/subject/authenticated` エンドポイントでは、 `@Authenticated` アノテーションを指定して、認証されたすべてのユーザーを許可します。

source: The `/subject/denied` endpoint declares the `@DenyAll` annotation, disallowing all direct access to it as a REST method, regardless of the user calling it. The method is still invokable internally by other methods in this class.
ja_jp: `/subject/denied` エンドポイントは `@DenyAll` アノテーションを宣言し、ユーザーが呼び出すかどうかに関係なく、REST メソッドとしてのすべての直接アクセスを禁止します。 このメソッドは、このクラスの他のメソッドによって引き続き内部的に呼び出すことができます。

source: The `/subject/denied` endpoint declares the `@DenyAll` annotation, thus disallowing all direct access to it as a REST method, regardless of the user calling it. The method is still invokable internally by other methods in this class.
ja_jp: `/subject/denied` エンドポイントは、 `@DenyAll` アノテーションを宣言しているため、呼び出すユーザーに関係なく、REST メソッドとして直接アクセスすることはすべて禁止されています。このメソッドは、このクラスの他のメソッドから内部的に呼び出すことは可能です。

source: The `/subject/denied` endpoint disallows any access regardless of whether the call is authenticated by specifying the `@DenyAll` annotation.
ja_jp: `/subject/denied` エンドポイントは、 `@DenyAll` アノテーションを指定することで、呼出が認証されているかどうかにかかわらず、あらゆるアクセスを禁止します。

source: The `/subject/secured` endpoint requires an authenticated user with the granted "Tester" role through the use of the `@RolesAllowed("Tester")` annotation.
ja_jp: `/subject/secured` エンドポイントは、 `@RolesAllowed("Tester")` アノテーションを使用して"Tester"というロールを付与された認証済みユーザーが必要です。

source: The `/subject/unsecured` endpoint allows for unauthenticated access by specifying the `@PermitAll` annotation.
ja_jp: `/subject/unsecured` エンドポイントでは、 `@PermitAll` アノテーションを指定することで、認証されていないアクセスが可能になります。

source: The `<name>` will be used in the consumer to refer to this provider. The `<property>` and `<value>` fields are specific to the `Vault Credentials Provider`. For complete details, please refer to the {vault-datasource-guide}.
ja_jp: `<name>` は、コンシューマーがこのプロバイダーを参照するために使用されます。 `<property>` および `<value>` フィールドは、 `Vault Credentials Provider` に特有です。完全な詳細については、{vault-datasource-guide}を参照してください。

source: The `@AccessToken` annotation enables an access token propagation to the target service.
ja_jp: `@AccessToken` アノテーションは、ターゲットサービスへのアクセストークンの伝播を可能にします。

source: The `@AuthorizationCodeFlow` annotation can be combined with any other standard security annotation like `@RolesAllowed`, `@PermissionsAllowed` and others.
ja_jp: `@AuthorizationCodeFlow` アノテーションは、 `@RolesAllowed` や `@PermissionsAllowed` などの他の標準セキュリティーアノテーションと組み合わせることができます。

source: The `@AuthorizationPolicy` annotation can be used together with other standard security annotations. As usual, the method-level annotation has priority over class-level annotation.
ja_jp: `@AuthorizationPolicy` アノテーションは、他の標準セキュリティーアノテーションと合わせて使用できます。 通常どおり、メソッドレベルのアノテーションはクラスレベルのアノテーションよりも優先されます。

source: The `@BindingsSource` annotation says that interceptor bindings for `MyClass` should be read from `MyClassBindings`.
ja_jp: `@BindingsSource` アノテーションによると、 `MyClass` のインターセプターバインディングは `MyClassBindings` から読み取る必要があります。

source: The `@BindingsSource` annotation specifies a class that mirrors the structure of the intercepted class. Interceptor bindings are then read from that class and treated as if they were declared on the intercepted class.
ja_jp: `@BindingsSource` アノテーションは、インターセプトされたクラスの構造を反映するクラスを指定します。 その後、インターセプターバインディングはそのクラスから読み取られ、インターセプトされたクラスで宣言されているかのように扱われます。

source: The `@Broadcast` annotation changes this behavior and indicates that messages transiting in the channel are dispatched to all the consumers. `@Broadcast` must be used with the `@Outgoing` annotation:
ja_jp: `@Broadcast` アノテーションはこの動作を変更し、チャネルを通過するメッセージがすべてのコンシューマーにディスパッチされることを示します。 `@Broadcast` は `@Outgoing` アノテーションと一緒に使用する必要があります。

source: The `@BsonId` annotation is used instead of `@BsonProperty("_id")` for brevity's sake, but use of either is valid.
ja_jp: 簡潔にするために `@BsonProperty("_id")` の代わりに `@BsonId` のアノテーションを使用していますが、どちらを使用しても構いません。

source: The `@BuildStep` annotation can also register marker files that determine which archives on the class path are considered to be 'Application Archives', and will therefore get indexed. This is done via the `applicationArchiveMarkers`. For example the ArC extension registers `META-INF/beans.xml`, which means that all archives on the class path with a `beans.xml` file will be indexed.
ja_jp: `@BuildStep` アノテーションは、クラスパス上のどのアーカイブが「アプリケーション・アーカイブ」とみなされ、したがってインデックスが作成されるかを決定するマーカーファイルを登録することもできます。これは `applicationArchiveMarkers` を介して行われます。たとえば、ArCエクステンションでは `META-INF/beans.xml` を登録していますが、これは `beans.xml` ファイルがあるクラスパス上のすべてのアーカイブがインデックスされることを意味します。

source: The `@CacheKey` annotation will be ignored because a key generator is declared in the `@CacheResult` annotation.
ja_jp: キー・ジェネレータが `@CacheResult` アノテーションで宣言されているため、 `@CacheKey` アノテーションは無視されます。

source: The `@CacheKey` annotation will be ignored when the `foo` cache data is invalidated, but `param1` will be the cache key when the `bar` cache data is invalidated.
ja_jp: `@CacheKey` アノテーションは `foo` キャッシュデータが無効化されると無視されますが、 `bar` キャッシュデータが無効化されると `param1` がキャッシュキーになります。

source: The `@Channel` annotation can also be used to inject the stream of messages from an incoming channel:
ja_jp: `@Channel` アノテーションは、着信チャネルからのメッセージストリームを注入するためにも使用できます。

source: The `@Channel` annotation lets you indicate to which channel you will send your payloads or messages. The `Emitter` allows buffering messages sent to the channel.
ja_jp: `@Channel` アノテーションを使用すると、ペイロードまたはメッセージを送信するチャネルを指定できます。 `Emitter` を使用すると、チャネルに送信されたメッセージをバッファリングできます。

source: The `@ConfigMapping` annotation indicates that the interface is a configuration mapping, in this case one which corresponds to a `quarkus.log` segment.
ja_jp: `@ConfigMapping` のアノテーションは、インターフェースが設定マッピングであることを示し、この場合、 `quarkus.log` セグメントに対応するものであることを示しています。

source: The `@ConfigMapping` annotation support the following naming stategies:
ja_jp: `@ConfigMapping` アノテーションは、以下のネーミング戦略に対応しています。

source: The `@ConfigMapping` annotation support the following naming strategies with the following enum values:
ja_jp: `@ConfigMapping` アノテーションは、以下の列挙値を持つ以下の命名法をサポートしています：

source: The `@ConfigMapping` annotation support the following naming strategies:
ja_jp: `@ConfigMapping` アノテーションは、以下のネーミング戦略をサポートします:

source: The `@ConfigProperty` annotation is needed because the name of the configuration property that the method corresponds does not follow the getter method naming conventions.
ja_jp: `@ConfigProperty` アノテーションが必要なのは、メソッドが対応する設定プロパティの名前が、ゲッターメソッドの命名規則に従っていないからです。

source: The `@ConfigRoot` annotation indicated to which Config phase, the configuration applies to.
ja_jp: `@ConfigRoot` アノテーションは、設定がどの設定フェーズに適用されるかを示したものです。

source: The `@ConfigRoot` annotation indicates that this object is a configuration root group, in this case one which corresponds to a `log` segment. A class name is used to link configuration root group with the segment from a property name. The `Configuration` part is stripped off from a `LogConfiguration` class name and the remaining `Log` is lowercased to become a `log`. Since all `@ConfigRoot` annotated classes uses `quarkus` as a prefix, this finally becomes `quarkus.log` and represents the properties which names begin with `quarkus.log.*`.
ja_jp: `@ConfigRoot` アノテーションは、このオブジェクトが設定ルートグループ、この場合は `log` セグメントに対応するものであることを示します。クラス名は、設定ルートグループをプロパティー名のセグメントにリンクするために使用されます。 `Configuration` の部分は `LogConfiguration` クラス名から削除され、残りの `Log` は小文字で `log` になります。すべての `@ConfigRoot` アノテーション付きクラスは接頭辞として `quarkus` を使用するため、これは最終的に `quarkus.log` になり、名前が `quarkus.log.*` で始まるプロパティーを表します。

source: The `@ConsumeEvent` annotation can be configured to set the address:
ja_jp: `@ConsumeEvent` アノテーションでアドレスを設定することができます。

source: The `@Dependent` beans are destroyed immediately, while other beans are not destroyed at all. This is important when multiple beans of different scopes might be returned by the `Instance`.
ja_jp: `@Dependent` Bean はすぐに破棄されますが、他の Bean は破棄されません。 これは、 `Instance` によって異なるスコープの複数の Bean が返される可能性がある場合に重要です。

source: The `@EngineConfiguration` annotation can be also used to register `ValueResolver`, `NamespaceResolver` and `ParserHook` components.
ja_jp: `@EngineConfiguration` アノテーションは、`ValueResolver`、`NamespaceResolver`、および `ParserHook` コンポーネントを登録するためにも使用できます。

source: The `@EngineConfiguration` annotation can be also used to register ``ValueResolver``s and ``NamespaceResolver``s.
ja_jp: `@EngineConfiguration` アノテーションは、 ``ValueResolver`` および ``NamespaceResolver`` を登録するためにも使用できます。

source: The `@Extension` annotation can be placed on resource classes and resource methods. However, the list of extensions defined at both places will *not* be combined. The effective extensions of an OpenAPI operation are either the list of extensions from the resource method, or if none are present the list of extensions from the resource class.
ja_jp: `@Extension` アノテーションはリソースクラスとリソースメソッドの両方に配置できます。ただし、両方の場所に定義されたエクステンションのリストは統合 *されません*。OpenAPI オペレーションの有効なエクステンションは、リソースメソッドのエクステンションリストか、存在しない場合はリソースクラスのエクステンションリストのいずれかになります。

source: The `@FullTextField` annotation declares a field in the index specifically tailored for full text search. In particular, we have to define an analyzer to split and analyze the tokens (~ words) - more on this later.
ja_jp: `@FullTextField` アノテーションは、全文検索用に特別に調整されたインデックスのフィールドを宣言します。特に、トークン（～単語）を分割して分析するためのアナライザーを定義する必要があります。 - これについては後で説明します。

source: The `@Incoming` and `@Outgoing` annotations are part of https://www.smallrye.io/smallrye-reactive-messaging[Reactive Messaging]. They are used to express from which _channel_ you are consuming and to which _channel_ you are sending. Thanks to https://smallrye.io/smallrye-reactive-messaging/latest/[SmallRye Reactive Messaging], you can consume and send messages from and to different brokers and transports such as HTTP, Pulsar, Kafka, RabbitMQ, JMS, or http://camel.apache.org/[Apache Camel].
ja_jp: `@Incoming` および `@Outgoing` アノテーションは、 https://www.smallrye.io/smallrye-reactive-messaging[Reactive Messaging] の一部です。 これらは、どの _channel_ から消費し、どの _channel_ に送信するかを表現するために使用されます。 https://smallrye.io/smallrye-reactive-messaging/latest/[SmallRye Reactive Messaging] のおかげで、HTTP、Pulsar、Kafka、RabbitMQ、JMS、または http://camel.apache.org/[Apache Camel] などのさまざまなブローカーやトランスポートとの間でメッセージを消費および送信できます。

source: The `@Incoming` channel consumer code can manipulate the processing state through the `CheckpointMetadata` API. For example, a consumer calculating the moving average of prices received on a Kafka topic would look the following:
ja_jp: `@Incoming` チャネルのコンシューマーコードは、 `CheckpointMetadata` API を通して処理ステートを操作できます。たとえば、Kafka トピックで受信した価格の移動平均を計算するコンシューマーは、以下のようになります。

source: The `@JvmRecord` annotation instructs the Kotlin compiler to generate a Java record in the bytecode, which Quarkus then recognizes as a type-safe template. Note that `@JvmRecord` requires Kotlin 1.5+ and JVM target 16+.
ja_jp: `@JvmRecord` アノテーションは、Kotlin コンパイラーにバイトコードで Java レコードを生成するように指示します。Quarkus はこれをタイプセーフなテンプレートとして認識します。`@JvmRecord` には Kotlin 1.5 以上と JVM ターゲット 16 以上が必要であることに注意してください。

source: The `@Localized` qualifier can be used to inject a localized message bundle interface.
ja_jp: `@Localized` 修飾子を使用して、ローカライズされたMessage Bundleインタフェースを注入することができます。

source: The `@Mapper` annotation is yet another annotation recognised by the DataStax Object Mapper. A mapper is responsible for constructing DAO instances – in this case, our mapper is constructing an instance of our only DAO, `FruitDao`.
ja_jp: `@Mapper` アノテーションは、DataStax Object Mapper によって認識されるもう一つのアノテーションです。マッパーは DAO インスタンスの構築を担当します。この場合、私たちのマッパーは唯一の DAO である `FruitDao` のインスタンスを構築しています。

source: The `@Mapper` annotation is yet another annotation recognized by the DataStax Object Mapper. A mapper is responsible for constructing DAO instances – in this case, out mapper is constructing an instance of our only DAO, `FruitDao`.
ja_jp: `@Mapper` アノテーションは、DataStax Object Mapperが認識する別のアノテーションです。マッパーはDAOインスタンスの構築を担当します。この場合、outマッパーは唯一のDAOである `FruitDao` のインスタンスを構築します。

source: The `@Mapper` annotation is yet another annotation recognized by the DataStax Object Mapper. A mapper is responsible for constructing instances of DAOs – in this case, out mapper is constructing an instance of our only DAO, `FruitDao`.
ja_jp: `@Mapper` アノテーションは、DataStaxObjectMapper によって認識されるさらに別のアノテーションです。マッパーは DAO のインスタンスを構築します。この場合に、アウトマッパーは唯一の DAO である `FruitDao` のインスタンスを構築しています。

source: The `@MongoEntity` annotation allows configuring:
ja_jp: `@MongoEntity` のアノテーションでは次の設定が可能です。

source: The `@Named` annotation allows to name the CDI bean to be used by the `quarkus.google-cloud-functions.function` property, this is optional.
ja_jp: `@Named` アノテーションでは、 `quarkus.google-cloud-functions.function` プロパティーで使用する CDI Beanに名前を付けることができますが、これはオプションです。

source: The `@Named` qualifier matches the module name from application.properties. The extension handles all the complexity of WASM module lifecycle, allowing us to focus on the business logic.
ja_jp: `@Named` 修飾子は、application.properties のモジュール名と一致します。エクステンションが WASM モジュールのライフサイクルの複雑さをすべて処理するため、開発者はビジネスロジックに集中できます。

source: The `@Named` qualifier, which you might be familiar with, is a _string-based qualifier_. That is, it's the string value of the qualifier annotation who determines whether the qualifier matches or not. This is not type-safe and should not be the norm in CDI applications. Specific qualifier types should be preferred.
ja_jp: 使い慣れているかもしれない `@Named` 修飾子は、_文字列ベースの修飾子_ です。つまり、修飾子が一致するかどうかを決定するのは、修飾子アノテーションの文字列値です。これはタイプセーフではなく、CDI アプリケーションでは一般的であるべきではありません。特定の修飾子タイプが推奨されます。

source: The `@Named` qualifier, which you might be familiar with, is somewhat different in CDI to all other qualifiers. See the xref:cdi-reference.adoc#string-based-qualifiers[corresponding section] in CDI Reference Guide for why you typically shouldn't use it.
ja_jp: `@Named` という修飾子はよく知られているかもしれませんが、CDI では他の修飾子とは多少異なります。 何故基本的に使うべきではないのか、CDIリファレンスガイドの xref:cdi-reference.adoc#string-based-qualifiers[該当セクション] を参照してください。

source: The `@NoClassInterceptors` annotation may be put on methods and constructors and means that all class-level interceptors are ignored for these methods and constructors. In other words, if a method/constructor is annotated `@NoClassInterceptors`, then the only interceptors that will apply to this method/constructor are interceptors declared directly on the method/constructor.
ja_jp: `@NoClassInterceptors` アノテーションはメソッドとコンストラクターに付けることができ、これらのメソッドとコンストラクターではすべてのクラスレベルのインターセプターが無視されることを意味します。つまり、メソッド/コンストラクターに `@NoClassInterceptors` アノテーションが付けられている場合、このメソッド/コンストラクターに適用されるインターセプターは、メソッド/コンストラクターで直接宣言されたインターセプターのみです。

source: The `@NoClassInterceptors` annotation may be put on methods and constructors, and means that all class-level interceptors are ignored for these methods and constructors. In other words, if a method/constructor is annotated `@NoClassInterceptors`, then the only interceptors that will apply to this method/constructor are interceptors declared directly on the method/constructor.
ja_jp: `@NoClassInterceptors` アノテーションはメソッドとコンストラクターに配置でき、これらのメソッドとコンストラクターではすべてのクラスレベルのインターセプターが無視されることを意味します。言い換えれば、メソッド/コンストラクターに `@NoClassInterceptors` アノテーションが付けられている場合、このメソッド/コンストラクターに適用されるインターセプターは、メソッド/コンストラクターで直接宣言されたインターセプターのみです。

source: The `@NonBlocking` annotation is only required with SmallRye Fault Tolerance 5.1.0 and earlier. Starting with SmallRye Fault Tolerance 5.2.0 (available since Quarkus 2.1.0.Final), it is not necessary. See https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/usage/extra.html#_non_compatible_mode[SmallRye Fault Tolerance documentation] for more information.
ja_jp: `@NonBlocking`アノテーションは、 SmallRye Fault Tolerance 5.1.0 以前でのみ必要です。SmallRye Fault Tolerance 5.2.0 以降 (Quarkus 2.1.0.Final 以降で使用可能) では必要ありません。詳細は、 https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/usage/extra.html#_non_compatible_mode[SmallRye Fault Tolerance documentation] を参照してください。

source: The `@OnPingMessage` and `@OnPongMessage` annotations can be used to define callbacks that consume ping or pong messages sent from the remote party. An endpoint may declare at most one `@OnPingMessage` callback and at most one `@OnPongMessage` callback. The callback method must return either `void` or `Uni<Void>` (or be a Kotlin `suspend` function returning `Unit`), and it must accept a single parameter of type `Buffer`.
ja_jp: `@OnPingMessage` および `@OnPongMessage` アノテーションを使用して、リモート側から送信された ping または pong メッセージを使用するコールバックを定義できます。 エンドポイントは、最大 1 つの `@OnPingMessage` コールバックと最大 1 つの `@OnPongMessage` コールバックを宣言できます。 コールバックメソッドは、 `void` または `Uni<Void>` を返す必要 (または `Unit` を返す Kotlin の `suspend` 関数である必要) があり、 `Buffer` タイプの単一のパラメーターを受け入れる必要があります。

source: The `@PermissionsAllowed` annotation at `/annotation-way` restricts access to requests that have the `Scope Permission Resource` permission along with the `read` scope. For more information, see the section xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[Authorization using annotations] of the Authorization of web endpoints guide.
ja_jp: `/annotation-way` の `@PermissionsAllowed` アノテーションは、 `Scope Permission Resource` パーミッションと `read` スコープを持つリクエストへのアクセスを制限します。 詳細については、Web エンドポイントの認可ガイドの xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[アノテーションを使用した認可] のセクションを参照してください。

source: The `@PermissionsAllowed` annotation at `/annotation-way` restricts access to requests that have the `Scope Permission Resource` permission along with the `read` scope. For more information, see the section xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[Authorization using annotations] of the Security Authorization guide.
ja_jp: `/annotation-way` の `@PermissionsAllowed` アノテーションは、 `read` スコープとともに `Scope Permission Resource` 権限を持つリクエストへのアクセスを制限します。 詳細は、セキュリティー認可ガイドの xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[アノテーションを使用した認可] のセクションを参照してください。

source: The `@PermitAll` is a standard Jakarta security annotation. It indicates that the given endpoint is accessible by all callers, whether authenticated or not.
ja_jp: `@PermitAll` は標準の Jakarta セキュリティーアノテーションです。これは、認証されているかどうかに関係なく、指定されたエンドポイントがすべての呼び出し元からアクセスできることを示します。

source: The `@PreAuthorize` annotations allows for the combination of expressions using logical `AND` / `OR`. Currently there is a limitation where only a single logical operation can be used (meaning mixing `AND` and `OR` isn't allowed).
ja_jp: `@PreAuthorize` アノテーションは、論理 `AND` / `OR` を使用した式の組み合わせを可能にします。現在、単一の論理演算しか使用できないという制限があります (つまり、 `AND` と `OR` を混在させることはできません)。

source: The `@PreAuthorize` annotations allows for the combination of expressions using logical `AND` / `OR`. Currently, there is a limitation where only a single logical operation can be used (meaning mixing `AND` and `OR` isn't allowed).
ja_jp: `@PreAuthorize` アノテーションは、論理 `AND` / `OR` を使用した式の組み合わせを可能にします。現在、単一の論理演算しか使用できないという制限があります (つまり、 `AND` と `OR` を混在させることはできません)。

source: The `@ProjectedFieldName` annotation also supports HQL expressions, including aggregate functions. This is particularly useful for GROUP BY queries:
ja_jp: `@ProjectedFieldName` アノテーションは、集計関数を含む HQL 式もサポートしています。 これは、特に GROUP BY クエリで役立ちます。

source: The `@QuarkusMain` annotation tells Quarkus that this is the main entry point.
ja_jp: `@QuarkusMain` のアノテーションは、Quarkusにここがメインエントリポイントであることを伝えます。

source: The `@QuarkusMain` indicates that Quarkus should use this class as the _main entry point_ of the application. The `run` method contains your application logic. We will come back to this logic later. First, look at the `public static void main(String... args)` method. It just starts the application. You can use this entry point directly from your IDE. Yes, there is still a bit of magic behind `Quarkus.run`; that's where the extension initialization happens - not unlike _any_ framework initialization including Vert.x. As this application does not use any extension, nothing much will happen.
ja_jp: `@QuarkusMain` は、Quarkusがこのクラスをアプリケーションの _メインエントリーポイント_ として使用することを示しています。 `run` メソッドには、アプリケーションのロジックが含まれています。このロジックについては後ほど説明します。まず、 `public static void main(String…​ args)` メソッドを見てください。これはアプリケーションを起動するだけです。このエントリーポイントは、IDE から直接使用できます。そう、 `Quarkus.run` の背後にはまだちょっとしたマジックがあります。エクステンションの初期化が行われるのは、 Vert.x を含む _どの_ フレームワークの初期化とも異なります。

source: The `@QuarkusSecurityTest` annotation can be used instead of the `@QuarkusTest` annotation.
ja_jp: `@QuarkusSecurityTest` アノテーションは、 `@QuarkusTest` アノテーションの代わりに使用できます。

source: The `@QuarkusTest` annotation can be grouped with other annotations by defining a custom meta-annotation. For instance, you can bundle it with the `@Tag` annotation to automatically mark a group of tests like in the example below:
ja_jp: `@QuarkusTest` アノテーションは、カスタムメタアノテーションを定義することで、他のアノテーションとグループ化できます。たとえば、以下の例のように、 `@Tag` アノテーションと組み合わせて、テストのグループを自動的にマークできます:

source: The `@ReactiveTransactional` annotation will also work for testing. This means that changes done during the test will be propagated to the database. If you want any changes made to be rolled back at the end of the test you can use the `io.quarkus.test.TestReactiveTransaction` annotation. This will run the test method in a transaction, but roll it back once the test method is complete to revert any database changes.
ja_jp: `@ReactiveTransactional` アノテーションはテストにも有効です。これは、テスト中に行われた変更がデータベースに反映されることを意味します。テスト終了時に変更をロールバックしたい場合は、 `io.quarkus.test.TestReactiveTransaction` アノテーションを使用します。これは、トランザクション内でテストメソッドを実行しますが、テストメソッドの終了時にデータベースへの変更をロールバックします。

source: The `@RegisterClientHeaders` annotation can also be used without any custom factory specified. In that case the `DefaultClientHeadersFactoryImpl` factory will be used. If you make a REST client call from a REST resource, this factory will propagate all the headers listed in `org.eclipse.microprofile.rest.client.propagateHeaders` configuration property from the resource request to the client request. Individual header names are comma-separated.
ja_jp: `@RegisterClientHeaders` アノテーションは、カスタムファクトリーを指定せずに使用することもできます。その場合、 `DefaultClientHeadersFactoryImpl` ファクトリーが使用されます。 REST リソースから REST クライアント呼び出しを行う場合、このファクトリーは、 `org.eclipse.microprofile.rest.client.propagateHeaders` 設定プロパティーにリストされているすべてのヘッダーをリソースリクエストからクライアントリクエストに伝播させます。個々のヘッダー名はコンマで区切られます。

source: The `@RegisterForReflection` annotation instructs Quarkus to include the class (including fields and methods) when building the native executable. This will be useful later when we run the applications as native executables inside containers. Without, the native compilation would remove the fields and methods during the dead-code elimination phase.
ja_jp: `@RegisterForReflection` アノテーションは、ネイティブ実行可能ファイルをビルドするときにクラス (フィールドとメソッドを含む) を含めるように Quarkus に指示します。これは、後でアプリケーションをコンテナー内のネイティブ実行可能ファイルとして実行するときに役立ちます。これがないと、ネイティブコンパイルによってデッドコード削除フェーズ中にフィールドとメソッドが削除されます。
